/*Завдання 3:
Запрограмуйте клас Money (об’єкт класу оперує однією валютою) для роботи з грошима.
В класі має бути передбачене поле для зберігання цілої частини грошей(долари, євро, гривні)
і поле для зберігання копійок (центи, євроценти, копійки і т. д.)
Реалізувати методи для виводу суми на екран, заданих значень на для частин.
На базі класу Money створити клас Product для роботи з продуктом чи товаром.
Реалізувати метод, що дозволяє зменшити ціну на задане число.
Для кожного класу реалізувати необхідні методи і поля.
*/

public class Main {
    public static void main(String[] args) {

        Money potatoPrice = new Money(1,35);
        Product potato = new Product("potato",potatoPrice);
        potato.display();

        potato.reducePrice(5);
        potato.display();

        potato.increasePrice(75);
        potato.display();


    }
}